st-sw/STC3117GenericDriver/src/stc311x_gasgauge.c
	return(res);

}


/*******************************************************************************
* Function Name  : STC31xx_ReadWord16
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC311x register,
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
static int STC31xx_ReadWord16(int RegAddress)
{
	int value;
	unsigned char data[2];
	int res;

	res=STC31xx_Read(2, RegAddress, data);

	if (res >= 0)
	{
		/* no error */
		value = data[1];
		value = (value <<8) + data[0];
	}
	else
		value=0;

	return(value);
}


int STC31xx_ReadUnsignedWord16(unsigned short RegAddress, unsigned short * RegData)
{
	unsigned short data16;
	unsigned char data8[2];
	int status;

	status = STC31xx_Read(2, RegAddress , data8);

	if (status >= 0)
	{
		/* no error */
		data16 = data8[1];
		data16 = (data16 <<8) | data8[0];
		
		*RegData = data16;
	}
	else
		status = -1;

	return(status);
}


/*******************************************************************************
* Function Name  : STC31xx_WriteWord16
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC311x register, Value: 16-bit value to write
* Return         : error status (STC31XX_OK, !STC31XX_OK)
*******************************************************************************/
static int STC31xx_WriteWord16(int RegAddress, int Value)
{
	int res;
	unsigned char data[2];

	data[0]= Value & 0xff; 
	data[1]= (Value>>8) & 0xff; 
	res = STC31xx_Write(2, RegAddress, data);

	return(res);

}



/* ---- end of I2C R/W interface --------------------------------------------- */


/* -------------------------------------------------------------------------- */

/* #define CurrentFactor  (24084/SENSERESISTOR)         LSB=5.88uV/R= ~24084/R/4096 - convert to mA  */
#define VoltageFactor  9011                          /* LSB=2.20mV ~9011/4096 - convert to mV         */



/*******************************************************************************
* Function Name  : STC311x_GetStatusWord16
* Description    :  Read the STC311x status
* Input          : None
* Return         : status word (REG_MODE / REG_CTRL), -1 if error
*******************************************************************************/
static int STC311x_GetStatusWord16(void)
{
	int value;

	/* first, check the presence of the STC311x by reading first byte of dev. ID */
	BattData.IDCode = STC31xx_ReadByte8(STC311x_REG_ID);
	if (BattData.IDCode!= STC3115_ID && BattData.IDCode!= STC3117_ID) return (-1);

	/* read REG_MODE and REG_CTRL */
	value = STC31xx_ReadWord16(STC311x_REG_MODE);
	value &= 0x7fff;   //(MSbit is unused, but used for error dectection here)

	return (value);
}



/*******************************************************************************
* Function Name  : STC3117_CheckI2cDeviceId
* Description    :  Read the hardcoded STC3115 ID number
* Input          : pointer to char
* Return         : status, -1 if error, -2 if bad ID
*******************************************************************************/
int STC31xx_CheckI2cDeviceId(void)
{
	unsigned char RegAddress;
	unsigned char data8;
	int status;

	RegAddress = STC311x_REG_ID;
	status = STC31xx_Read(1, RegAddress , &data8);

	if (status >= 0)
	{
		if(data8 == STC3117_ID)
		{
			status = 0; //OK
		}
		else
		{
			status = -2; //I2C is working, but the ID doesn't match.
		}
	}
	else
	{
		status = -1; // I2C error
	}

	return(status);
}

/*******************************************************************************
* Function Name  : STC3117_GetRunningCounter
* Description    :  Get the STC3115 Convertion counter value
* Input          : None
* Return         : status word (REG_COUNTER), -1 if error
*******************************************************************************/
int STC31xx_GetRunningCounter(void)
{
	unsigned short value;
	int status;

	/* read STC3117_REG_COUNTER */
	status = STC31xx_ReadUnsignedWord16(STC311x_REG_COUNTER, &value);

	if(status < 0) //error
		value = -1;

	return ((int)value);
}


/*******************************************************************************
* Function Name  : STC311x_SetParam
* Description    :  initialize the STC311x parameters
* Input          : rst: init algo param
* Return         : 0
*******************************************************************************/
static void STC311x_SetParam(void)
{
	int value;
	int i;

	STC31xx_WriteByte8(STC311x_REG_MODE,0x01);  /*   set GG_RUN=0 before changing algo parameters */

	/* init OCV curve */
#ifdef STC3115  
	STC31xx_Write(OCVTAB_SIZE, STC311x_REG_OCVTAB, (unsigned char *) BattData.OCVOffset);
#endif
#ifdef STC3117
	for (i=0; i < OCVTAB_SIZE; i++)
		if (BattData.OcvValue[i]!=0) STC31xx_WriteWord16(STC311x_REG_OCVTAB + i*OCVTAB_BYTECOUNT, BattData.OcvValue[i]*100/55);

	//if new SOCTAB value from user, overwrite the default register values.
	if (BattData.SoctabValue[1]!=0) STC31xx_Write(SOCTAB_SIZE, STC311x_REG_SOCTAB, (unsigned char *) BattData.SoctabValue);
#endif

	/* set alm level if different from default */
	if (BattData.Alm_SOC !=0 )   
		STC31xx_WriteByte8(STC311x_REG_ALARM_SOC,BattData.Alm_SOC*2); 
	if (BattData.Alm_Vbat !=0 ) 
	{
		value= ((BattData.Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.44mV */
		STC31xx_WriteByte8(STC311x_REG_ALARM_VOLTAGE, value);
	}

	/* relaxation timer */
	if (BattData.RelaxThreshold !=0 )  
	{
		value= ((BattData.RelaxThreshold << 9) / BattData.CurrentFactor);   /* LSB=8*5.88uV/Rsense */
		value = value & 0x7f;
		STC31xx_WriteByte8(STC311x_REG_CURRENT_THRES,value); 
	}

	/* set parameters if different from default, only if a restart is done (battery change) */
	if (GG_Ram.reg.CC_cnf !=0 ) STC31xx_WriteWord16(STC311x_REG_CC_CNF,GG_Ram.reg.CC_cnf); 
	if (GG_Ram.reg.VM_cnf !=0 ) STC31xx_WriteWord16(STC311x_REG_VM_CNF,GG_Ram.reg.VM_cnf); 

	STC31xx_WriteByte8(STC311x_REG_CTRL,0x03);  /*   clear PORDET, BATFAIL, free ALM pin, reset conv counter */
	if (BattData.Vmode)
		STC31xx_WriteByte8(STC311x_REG_MODE,0x19);  /*   set GG_RUN=1, voltage mode, alm enabled */
	else
		STC31xx_WriteByte8(STC311x_REG_MODE,0x18);  /*   set GG_RUN=1, mixed mode, alm enabled */

	return;
}  




