st-sw/STC3117GenericDriver/src/stc311x_gasgauge.c
/*******************************************************************************
* Function Name  : STC311x_Startup
* Description    :  initialize and start the STC311x at application startup
* Input          : None
* Return         : 0 if ok, -1 if error
*******************************************************************************/
static int STC311x_Startup(void)
{
	int res;
	int ocv, current;

	/* check STC311x status */
	res = STC311x_GetStatusWord16();
	if (res<0) return(res);

	/* read OCV */
	ocv=STC31xx_ReadWord16(STC311x_REG_OCV);

	STC311x_SetParam();  /* set parameters  */

#ifdef STC3117
	/* with STC3117, it is possible here to read the current and compensate OCV: */
	current=STC31xx_ReadWord16(STC311x_REG_CURRENT);  
	current &= 0x3fff;   /* mask unused bits */
	if (current>=0x2000) current -= 0x4000;  /* convert to signed value */  
	ocv = ocv - BattData.Rint * current * 588 / BattData.Rsense / 55000 ;
#endif  

	/* rewrite ocv to start SOC with updated OCV curve */
	STC31xx_WriteWord16(STC311x_REG_OCV,ocv);

	return(0);
}


/*******************************************************************************
* Function Name  : STC311x_Restore
* Description    :  Restore STC311x state
* Input          : None
* Return         : 
*******************************************************************************/
static int STC311x_Restore(void)
{
	int res;
	int ocv;

	/* check STC310x status */
	res = STC311x_GetStatusWord16();
	if (res<0) return(res);

	/* read OCV */
	ocv=STC31xx_ReadWord16(STC311x_REG_OCV);

	STC311x_SetParam();  /* set parameters  */

#if 1
	/* if restore from unexpected reset, restore SOC (system dependent) */
	if (GG_Ram.reg.GG_Status == GG_RUNNING)
		if (GG_Ram.reg.SOC != 0)
			STC31xx_WriteWord16(STC311x_REG_SOC,GG_Ram.reg.HRSOC);  /*   restore SOC */
#else  
	/* rewrite ocv to start SOC with updated OCV curve */
	STC31xx_WriteWord16(STC311x_REG_OCV,ocv);
#endif  
	return(0);
}




/*******************************************************************************
* Function Name  : STC311x_Powerdown
* Description    :  stop the STC311x at application power down
* Input          : None
* Return         : error status (STC31XX_OK, !STC31XX_OK)
*******************************************************************************/
static int STC311x_Powerdown(void)
{
	int res;

	/* write 0x01 into the REG_CTRL to release IO0 pin open, */
	STC31xx_WriteByte8(STC311x_REG_CTRL, 0x01);

	/* write 0 into the REG_MODE register to put the STC311x in standby mode */
	res = STC31xx_WriteByte8(STC311x_REG_MODE, 0);
	if (res!= STC31XX_OK) return (res);

	return (STC31XX_OK);
}


/*******************************************************************************
* Function Name  : STC311x_xxxx
* Description    :  misc STC311x utility functions
* Input          : None
* Return         : None
*******************************************************************************/
static void STC311x_Reset(void)
{
	STC31xx_WriteByte8(STC311x_REG_CTRL, STC311x_SOFTPOR);  /*   set soft POR */
}

static void STC311x_Reset_Adj(void)
{
	//register only available in STC3115

#ifdef STC3115
	int value;

	value=STC31xx_ReadByte8(STC311x_REG_MODE);
	STC31xx_WriteByte8(STC311x_REG_MODE,value | (STC311x_CLR_VM_ADJ+STC311x_CLR_CC_ADJ) );
#endif  
}

static void STC311x_SetSOC(int SOC)
{
	STC31xx_WriteWord16(STC311x_REG_SOC,SOC);   
}

static void STC311x_ForceVM(void)
{
	int value;

	value=STC31xx_ReadByte8(STC311x_REG_MODE);
	STC31xx_WriteByte8(STC311x_REG_MODE,value | STC311x_FORCE_VM);   /*   force VM mode */
}

static void STC311x_ForceCC(void)
{
	int value;

	value=STC31xx_ReadByte8(STC311x_REG_MODE);
	STC31xx_WriteByte8(STC311x_REG_MODE,value | STC311x_FORCE_CC);  /*   force CC mode */   
}



static int STC311x_SaveCnf(void)
{
	int reg_mode,value;

	/* mode register*/
	reg_mode = BattData.STC_Status & 0xff;

	reg_mode &= ~STC311x_GG_RUN;  /*   set GG_RUN=0 before changing algo parameters */
	STC31xx_WriteByte8(STC311x_REG_MODE, reg_mode);  

	//STC31xx_ReadByte8(STC311x_REG_ID);

	STC31xx_WriteWord16(STC311x_REG_VM_CNF,GG_Ram.reg.VM_cnf); 
	value = STC31xx_ReadWord16(STC311x_REG_SOC); 
	STC31xx_WriteWord16(STC311x_REG_SOC,value); 
	STC31xx_WriteWord16(STC311x_REG_CC_CNF,GG_Ram.reg.CC_cnf); 

	if (BattData.Vmode)
	{
		STC31xx_WriteByte8(STC311x_REG_MODE,0x19);  /*   set GG_RUN=1, voltage mode, alm enabled */
	}
	else
	{
		STC31xx_WriteByte8(STC311x_REG_MODE,0x18);  /*   set GG_RUN=1, mixed mode, alm enabled */
		if (BattData.GG_Mode == CC_MODE)
			STC31xx_WriteByte8(STC311x_REG_MODE,0x38);  /*   force CC mode */   
		else
			STC31xx_WriteByte8(STC311x_REG_MODE,0x58);  /*   force VM mode */
	}

	return(0);
}

static int STC311x_SaveVMCnf(void)
{
	int reg_mode;

	/* mode register*/
	reg_mode = BattData.STC_Status & 0xff;

	reg_mode &= ~STC311x_GG_RUN;  /*   set GG_RUN=0 before changing algo parameters */
	STC31xx_WriteByte8(STC311x_REG_MODE, reg_mode);  

	//STC31xx_ReadByte8(STC311x_REG_ID);

	STC31xx_WriteWord16(STC311x_REG_VM_CNF,GG_Ram.reg.VM_cnf); 

	if (BattData.Vmode)
	{
		STC31xx_WriteByte8(STC311x_REG_MODE,0x19);  /*   set GG_RUN=1, voltage mode, alm enabled */
	}
	else
	{
		STC31xx_WriteByte8(STC311x_REG_MODE,0x18);  /*   set GG_RUN=1, mixed mode, alm enabled */
		if (BattData.GG_Mode == CC_MODE)
			STC31xx_WriteByte8(STC311x_REG_MODE,0x38);  /*   force CC mode */   
		else
			STC31xx_WriteByte8(STC311x_REG_MODE,0x58);  /*   force VM mode */
	}

	return(0);
}





/*******************************************************************************
* Function Name  : conv
* Description    : conversion utility 
*  convert a raw 16-bit value from STC311x registers into user units (mA, mAh, mV, °C)
*  (optimized routine for efficient operation on 8-bit processors such as STM8)
* Input          : value, factor
* Return         : result = value * factor / 4096
*******************************************************************************/
static int conv(short value, unsigned short factor)
{
	int v;

