st-sw/STC3117GenericDriver/src/stc311x_gasgauge.c
	v= ( (long) value * factor ) >> 11;
	v= (v+1)/2;

	return (v);
}

/*******************************************************************************
* Function Name  : STC311x_ReadBatteryData
* Description    :  utility function to read the battery data from STC311x
*                  to be called every 5s or so
* Input          : ref to BattData structure
* Return         : error status (STC31XX_OK, !STC31XX_OK)
*******************************************************************************/
static int STC311x_ReadBatteryData(STC311x_BattDataTypeDef *BattData)
{
	unsigned char data[16];
	int res;
	int value;

	res=STC311x_GetStatusWord16();
	if (res<0) return(res);  /* return if I2C error or STC3115 not responding */

	/* STC311x status */
	BattData->STC_Status = res;
	if (BattData->STC_Status & M_GGVM)
		BattData->GG_Mode = VM_MODE;   /* VM active */
	else 
		BattData->GG_Mode = CC_MODE;   /* CC active */

#ifdef STC3115
	/* read STC3115 registers 0 to 10 */
	res=STC31xx_Read(11, 0, data);
#endif  
#ifdef STC3117
	/* read STC3117 registers 0 to 14 */
	res=STC31xx_Read(15, 0, data);
#endif  
	if (res<0) return(res);  /* read failed */

	/* fill the battery status data */
	/* SOC */
	value=data[3]; value = (value<<8) + data[2];
	BattData->HRSOC = value;     /* result in 1/512% */

	/* conversion counter */
	value=data[5]; value = (value<<8) + data[4];
	BattData->ConvCounter = value;

	/* current */
	value=data[7]; value = (value<<8) + data[6];
	value &= 0x3fff;   /* mask unused bits */
	if (value>=0x2000) value -= 0x4000;  /* convert to signed value */
	BattData->Current = conv(value, BattData->CurrentFactor);  /* result in mA */

	/* voltage */
	value=data[9]; value = (value<<8) + data[8];
	value &= 0x0fff; /* mask unused bits */
	if (value>=0x0800) value -= 0x1000;  /* convert to signed value */
	value = conv(value,VoltageFactor);  /* result in mV */
	BattData->Voltage = value;  /* result in mV */

	/* temperature */
	value=data[10]; 
	if (value>=0x80) value -= 0x100;  /* convert to signed value */
	BattData->Temperature = value*10;  /* result in 0.1°C */

#ifdef STC3115
	/* read STC3115 registers CC & VM adj low */
	res=STC31xx_Read(2, STC311x_REG_CC_ADJ_LOW, data);
	if (res<0) return(res);  /* read failed */
	/* read STC3115 registers CC & VM adj high and OCV */
	res=STC31xx_Read(4, STC311x_REG_CC_ADJ_HIGH, &data[2]);
	if (res<0) return(res);  /* read failed */
	// data 0: CC_ADJ_L, 1: VM_ADJ_L, 2: CC_ADJ_H, 3: VM_ADJ_H, 4-5: OCV

	/* CC & VM adjustment counters */
	value=data[2]; value = (value<<8) + data[0];
	if (value>=0x8000) value -= 0x10000;  /* convert to signed value */
	BattData->CC_adj = value;//in 1/512%  
	value=data[3]; value = (value<<8) + data[1];
	if (value>=0x8000) value -= 0x10000;  /* convert to signed value */
	BattData->VM_adj = value;//in 1/512%  

	/* OCV */
	value=data[5]; value = (value<<8) + data[4];
	value &= 0x3fff; /* mask unused bits */
	if (value>=0x02000) value -= 0x4000;  /* convert to signed value */
	value = conv(value,VoltageFactor);  
	value = (value+2) / 4;  /* divide by 4 with rounding */
	BattData->OCV = value;  /* result in mV */
#endif

#ifdef STC3117
	/* Avg current */
	value=data[12]; value = (value<<8) + data[11];
	if (value>=0x8000) value -= 0x10000;  /* convert to signed value */
	if (BattData->Vmode==0)
	{
		value = conv(value, BattData->CurrentFactor);
		value = value / 4;  /* divide by 4  */
	}
	else
	{
		value = conv(value, BattData->CRateFactor);
	}
	BattData->AvgCurrent = value;  /* result in mA */

	/* OCV */
	value=data[14]; value = (value<<8) + data[13];
	value &= 0x3fff; /* mask unused bits */
	if (value>=0x02000) value -= 0x4000;  /* convert to signed value */
	value = conv(value,VoltageFactor);  
	value = (value+2) / 4;  /* divide by 4 with rounding */
	BattData->OCV = value;  /* result in mV */

	/* read STC3117 registers CC & VM adj */
	res=STC31xx_Read(4, STC311x_REG_CC_ADJ, data);
	if (res<0) return(res);  /* read failed */

	/* CC & VM adjustment counters */
	value=data[1]; value = (value<<8) + data[0];
	if (value>=0x8000) value -= 0x10000;  /* convert to signed value */
	BattData->CC_adj = value; /* in 1/512% */
	value=data[3]; value = (value<<8) + data[2];
	if (value>=0x8000) value -= 0x10000;  /* convert to signed value */
	BattData->VM_adj = value; /* in 1/512% */
#endif

	/* relax counter */
	res=STC31xx_Read(1, STC311x_REG_CMONIT_COUNT, data);
	if (res<0) return(res);  /* read failed */
	BattData->RelaxTimer = data[0];


	return(STC31XX_OK);
}


/*******************************************************************************
* Function Name  : STC311x_ReadRamData
* Description    : utility function to read the RAM data from STC311x
* Input          : ref to RAM data array
* Return         : error status (STC31XX_OK, !STC31XX_OK)
*******************************************************************************/
static int STC311x_ReadRamData(unsigned char *RamData)
{
	return(STC31xx_Read(RAM_SIZE, STC311x_REG_RAM, RamData));
}


/*******************************************************************************
* Function Name  : STC311x_WriteRamData
* Description    : utility function to write the RAM data into STC311x
* Input          : ref to RAM data array
* Return         : error status (STC31XX_OK, !STC31XX_OK)
*******************************************************************************/
static int STC311x_WriteRamData(unsigned char *RamData)
{
	return(STC31xx_Write(RAM_SIZE, STC311x_REG_RAM, RamData));
}

/******************************************************************************* 
* Function Name  : Interpolate
* Description    : interpolate a Y value from a X value and X, Y tables (n points)
* Input          : x
* Return         : y
*******************************************************************************/
static int interpolate(int x, int n, int const *tabx, int const *taby )
{  
	int index;
	int y;

	if (x >= tabx[0])
		y = taby[0];
	else if (x <= tabx[n-1])
		y = taby[n-1];
	else
	{
		/*  find interval */
		for (index= 1;index<n;index++)
			if (x > tabx[index]) break;
		/*  interpolate */
		y = (taby[index-1] - taby[index]) * (x - tabx[index]) * 2 / (tabx[index-1] - tabx[index]);
		y = (y+1) / 2;
		y += taby[index];
	}    
	return y;
}



