st-sw/STC3117GenericDriver/src/stc311x_gasgauge.c
	if (BattData.SOC>800)  Var3=600;
	else if (BattData.SOC>500) Var3=400;
	else if (BattData.SOC>250) Var3=200;
	else if (BattData.SOC>100) Var3=300;
	else Var3=400;

	Var1= 256*BattData.AvgCurrent*A_Var3/Var3/CURRENT_TH;
	Var1= 32768 * GAIN / (256+Var1*Var1/256) / 10;
	Var1 = (Var1+1)/2;
	if (Var1==0) Var1=1;
	if (Var1>=VAR1MAX) Var1=VAR1MAX-1;
	GG->Var1 = Var1;

	Var4=BattData.CC_adj-BattData.VM_adj;
	if (BattData.GG_Mode == CC_MODE)  
		SOCopt = BattData.HRSOC - BattData.CC_adj + Var1      * Var4 / 64;
	else
		SOCopt = BattData.HRSOC - BattData.VM_adj - (64-Var1) * Var4 / 64;

	Var2 = BattData.Nropt;
	if ( (BattData.AvgCurrent < -CURRENT_TH) || (BattData.AvgCurrent > CURRENT_TH) ) 
	{
		if (Var2<VAR2MAX)  Var2++;
		BattData.Ropt = BattData.Ropt + ( 1000 * (BattData.Voltage-BattData.OCV) / BattData.AvgCurrent - BattData.Ropt / Var2);
		BattData.Nropt = Var2;
	}
	if (Var2>0)
		GG->Ropt = BattData.Ropt / Var2;
	else
		GG->Ropt = 0;  // not available

	if (SOCopt <= 0 )
		SOCopt = 0;
	if (SOCopt >= MAX_HRSOC)
		SOCopt = MAX_HRSOC;
	BattData.SOC = (SOCopt*10+256)/512;
	if ( (Var4<(-VAR4MAX)) || (Var4>=VAR4MAX) )
	{
		// rewrite SOCopt into STC311x
		STC31xx_WriteWord16(STC311x_REG_SOC, SOCopt); 
		// clear acc registers
		STC311x_Reset_Adj();
	}

#endif

}

/* --------------------------------------------------------------------------------------------- */



/* -------------------- firmware interface functions ------------------------------------------- */




/*******************************************************************************
* Function Name  : GasGauge_Start
* Description    : Start the Gas Gauge system
* Input          : algo parameters in GG structure
* Return         : 0 is ok, -1 if STC310x not found or I2C error
* Affect         : global STC310x data and gas gauge variables
*******************************************************************************/
int GasGauge_Start(GasGauge_DataTypeDef *GG)
{
	int res, i;

	BattData.Cnom = GG->Cnom;
	BattData.Rsense = GG->Rsense;
	BattData.Rint = GG->Rint;
	BattData.Vmode = GG->Vmode;
	BattData.CC_cnf = GG->CC_cnf; 
	BattData.VM_cnf = GG->VM_cnf; 
	BattData.Alm_SOC = GG-> Alm_SOC; 
	BattData.Alm_Vbat = GG->Alm_Vbat; 
	BattData.RelaxThreshold = GG->RelaxCurrent;

	// BATD
	BattData.BattOnline = 1;

	if (BattData.Rsense==0) BattData.Rsense=10;  /* default value in case, to avoid divide by 0 */
	BattData.CurrentFactor=24084/BattData.Rsense;    /* LSB=5.88uV/R= ~24084/R/4096 - convert to mA  */
#ifdef STC3117
	BattData.CRateFactor=36*BattData.Cnom;        /* LSB=0.008789.Cnom= 36*Cnom/4096 - convert to mA  */
#endif

	if (BattData.CC_cnf==0) BattData.CC_cnf=395;  /* default values */
	if (BattData.VM_cnf==0) BattData.VM_cnf=321;

	for (i=0;i<NTEMP;i++)
		BattData.CapacityDerating[i] = GG->CapDerating[i]; 
	for (i=0;i<OCVTAB_SIZE;i++)
	{
#ifdef STC3115  
		BattData.OCVOffset[i] = GG->OCVOffset[i]; 
#endif
#ifdef STC3117
		BattData.OcvValue[i] = GG->OcvValue[i]; 
		BattData.SoctabValue[i] = GG->SoctabValue[i]; 
#endif
	}	
	for (i=0;i<NTEMP;i++)
		BattData.VM_TempTable[i] = DefVMTempTable[i];    

	BattData.Ropt = 0;
	BattData.Nropt = 0;

	/* check STC311x status */
	res = STC311x_GetStatusWord16();
	if (res<0) return(res);


	/* check RAM valid */
	STC311x_ReadRamData(GG_Ram.db);

	if ( (GG_Ram.reg.TstWord != RAM_TESTWORD) || (calcCRC8(GG_Ram.db,RAM_SIZE)!=0) )
	{
		/* RAM invalid */
		Init_RAM();
		res=STC311x_Startup();  /* return -1 if I2C error or STC3115 not present */
	}
	else
	{
		/* check STC311x status */
		if ((STC311x_GetStatusWord16() & M_RST) != 0 )
		{
			res=STC311x_Startup();  /* return -1 if I2C error or STC3115 not present */
		}
		else
		{
			res=STC311x_Restore(); /* recover from last SOC */
		}
	}


	GG_Ram.reg.GG_Status = GG_INIT;
	/* update the crc */
	UpdateRamCrc();
	STC311x_WriteRamData(GG_Ram.db);

	Reset_FSM_GG();

	return(res);    /* return -1 if I2C error or STC3115 not present */
}





/*******************************************************************************
Restart sequence:
Usage: 
call GasGaugeReset()
powerdown everything
wait 500ms
call GasGaugeStart(GG)
continue 
*******************************************************************************/


/*******************************************************************************
* Function Name  : GasGauge_Reset
* Description    : Reset the Gas Gauge system
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
void GasGauge_Reset(void)  
{
	GG_Ram.reg.TstWord=0;  /* reset RAM */
	GG_Ram.reg.GG_Status = 0;
	STC311x_WriteRamData(GG_Ram.db);

	STC311x_Reset();
}



/*******************************************************************************
* Function Name  : GasGauge_Stop
* Description    : Stop the Gas Gauge system
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int GasGauge_Stop(void)
{
	int res;

	STC311x_ReadRamData(GG_Ram.db);
	GG_Ram.reg.GG_Status= GG_POWERDN;
	/* update the crc */
	UpdateRamCrc();
	STC311x_WriteRamData(GG_Ram.db);

	res=STC311x_Powerdown();
	if (res!=0) return (-1);  /* error */

	return(0);  
}



/*******************************************************************************
* Function Name  : GasGauge_Task
* Description    : Periodic Gas Gauge task, to be called e.g. every 5 sec.
* Input          : pointer to gas gauge data structure
* Return         : 1 if data available, 0 if no data, -1 if error
* Affect         : global STC310x data and gas gauge variables
*******************************************************************************/
int GasGauge_Task(GasGauge_DataTypeDef *GG)
{
	int res, value;

	BattData.Rsense = GG->Rsense;
	BattData.Vmode = GG->Vmode;
	BattData.Alm_SOC = GG-> Alm_SOC; 
	BattData.Alm_Vbat = GG->Alm_Vbat; 
	BattData.RelaxThreshold = GG->RelaxCurrent;

	res=STC311x_ReadBatteryData(&BattData);  /* read battery data into global variables */
	if (res!=0) return(-1); /* abort in case of I2C failure */

